W6D4/first_route_project/app/controllers/artworks_controller.rb

    def index
        # render json: Artwork.all
        user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]