W6D4/first_route_project/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-07-09 17:12:22.586379"], ["updated_at", "2020-07-09 17:12:22.586379"], ["name", "\"Amy\""], ["email", "\"amy@hotmail.com\""]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "\"Molly\""], ["updated_at", "2020-07-09 04:37:09.823116"], ["id", 3]]
---
    def update
        user = User.find(params[:id])
        if user.update_attributes(user_params)