W8D1/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def is_mod?
        @sub = Sub.find_by(id: params[:id])

INSERT INTO "subs" ("title", "description", "created_at", "updated_at", "mod_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "/r/News"], ["description", "current events are awesome!"], ["created_at", "2020-07-20 23:13:34.382797"], ["updated_at", "2020-07-20 23:13:34.382797"], ["mod_id", 3]]
---
    def create
        @sub = Sub.new(sub_params)
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @sub = current_user.subs.find_by(id: params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "/r/world_new"], ["updated_at", "2020-07-20 23:19:48.116709"], ["id", 2]]
---
    def update
        @sub = current_user.subs.find_by(id: params[:id])
        if @sub.update(sub_params)