W4D3/W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "description", "created_at", "updated_at", "sex") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if  @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Black"], ["description", "      Coder Best!      \r\n    \r\n    "], ["updated_at", "2020-07-10 23:49:48.995185"], ["id", 1]]
---
    def update
        @cat = Cat.find(params[:id])

        if  @cat.update(cat_params)